{
    "metadata": {
        "document_date": "07/24/2017",
        "document_source": "https://ccc.gov.kh/detail_info_en.php?_txtID=791"
    },

    "chapters": [
        {
            "id": 1,
            "title": "ON THE SOVEREIGNTY",
            "articles": [
                {
                    "id": 1,
                    "content": "Cambodia is a Kingdom where the King shall fulfill His\nfunctions according to the Constitution and the principles of\nliberal multi-party democracy.\nThe Kingdom of Cambodia is an independent, sovereign,\npeaceful, permanently neutral and non-aligned State."
                },
                {
                    "id": 2,
                    "content": "The territorial integrity of the Kingdom of Cambodia\nshall be absolutely inviolable within its borders as defined in\nthe 1/100,000 scale map made between the years 1933-1953,\nand internationally recognized between the years 1963 - 1969."
                },
                {
                    "id": 3,
                    "content": "The Kingdom of Cambodia is an indivisible State."
                },
                {
                    "id": 4,
                    "content": "The motto of the Kingdom of Cambodia is: Nation, Religion, King."
                },
                {
                    "id": 5,
                    "content": "The official language and script are those in Khmer."
                },
                {
                    "id": 6,
                    "content": "Phnom Penh is the capital city of the Kingdom of\nCambodia.\nThe national flag, anthem and coat of arms are defined in\nAnnexes 1, 2 and 3."
                }
            ]
        },
        {
            "id": 2,
            "title": "ON THE KING",
            "articles": [
                {
                    "id": 7,
                    "content": "The King of Cambodia shall reign, but not govern.\nThe King is the Head of State for life.\nThe Person of the King shall be inviolable."
                },
                {
                    "id": 8,
                    "content": "The King shall incarnate the symbol of national unity and\ncontinuity.\nThe King shall be the guarantor of the national\nindependence, the sovereignty and the territorial integrity of\nthe Kingdom of Cambodia, and the guarantor for the respect of\ncitizens’ rights and freedom, and of international treaties."
                },
                {
                    "id": 9,
                    "content": "The King shall assume the role as supreme arbiter to\nensure the regular functioning of public powers."
                },
                {
                    "id": 10,
                    "content": "The Cambodian monarchy is an elective monarchy.\nThe King has no power to appoint a heir to the throne."
                },
                {
                    "id": 11,
                    "tags": ["new"],
                    "content": "in case the King cannot as usual perform His duties of\nHead of State for being seriously ill, as certified by a team\nof specialized medical doctors chosen by the President of the\nSenate, the President of the National Assembly and the Prime\nMinister, the President of the Senate shall perform the duties of\nHead of State as Regent in His stead.\nIn case the President of the Senate cannot perform\nhis duties of Head of State in the stead of the King, acting\nas Regent, while the King is seriously ill as stipulated in the\naforementioned paragraph, the President of the National\nAssembly shall perform these duties.\nIn the case stated in the aforementioned paragraph, other\ndignitaries in the following hierarchy can perform the role of\nRegent as Acting Head of State:\na - First Vice-President of the Senate\nb - First Vice-President of the National Assembly\nc - Second Vice-President of the Senate\nd - Second Vice-President of the National Assembly"
                },
                {
                    "id": 12,
                    "tags": ["new"],
                    "content": "At the decease of the King, the President of the Senate\nshall perform the role of Head of State ad interim in his capacity\nas Regent of the Kingdom of Cambodia.\nIn case the President of the Senate cannot perform his\nduties of Head of Statead interim in his capacity as Regent,\nthe paragraphs 2 and 3 of Article 11 new must be implemented."
                },
                {
                    "id": 13,
                    "tags": ["new"],
                    "content": "Within a period not exceeding seven days, the new King\nof Cambodia shall be elected by the Crown Council.\nThe members of the Crown Council shall be composed\nof:\n-The President of the Senate\nUnofficial Translation\n7\n-The President of the National Assembly\n-The Prime Minister\n-The Supreme Patriarchs of the two religious orders,\nMahanikaya and Dhammayutikanikaya\n-The First and Second Vice-Presidents of the Senate\n- The First and Second Vice-Presidents of the National\nAssembly\nThe organization and functioning of the Crown Council\nshall be determined by law."
                },
                {
                    "id": 14,
                    "content": "Shall be elected King of Cambodia, a member of the\nRoyal family, aged at least 30 years, descendant of King Ang\nDuong or of King Norodom or also of King Sisowath.\nBefore ascending the throne, the King shall take oath as\nstipulated in Annex 4."
                },
                {
                    "id": 15,
                    "content": "The Consort of the King shall have the title of Queen of\nthe Kingdom of Cambodia."
                },
                {
                    "id": 16,
                    "content": "The Queen of the Kingdom of Cambodia shall have no\nright to engage in politics, to assume a leading function in State or\nGovernment affairs, or to assume an administrative or political\nrole.\nThe Queen of the Kingdom of Cambodia shall devote\nherself to tasks of social, humanitarian, religious interests, and\nassist the King in protocol and diplomatic duties."
                },
                {
                    "id": 17,
                    "content": "The provision, in which the King shall reign but\nnot govern, as stipulated in Article 7 paragraph 1 of this\nConstitution, cannot in any case be modified."
                },
                {
                    "id": 18,
                    "tags": ["new"],
                    "content": "The King communicates with the Senate and the National\nAssembly through royal messages.\nThese royal messages cannot be subject to debate at the\nSenate and the National Assembly"
                },
                {
                    "id": 19,
                    "tags": ["new", "two"],
                    "content": "The King shall appoint the Prime Minister and the Council\nof Ministers in accordance with the procedures stipulated in\nArticle 119 new (two)."
                },
                {
                    "id": 20,
                    "tags": [],
                    "content": "The King grants official audiences twice a month to the\nPrime Minister and the Council of Ministers to report to Him\non the situation of the country."
                },
                {
                    "id": 21,
                    "tags": [],
                    "content": "Upon the request of the Council of Ministers, the King\nshall sign the Royal Decree of appointment, transfer or dismissal\nof high-ranking civil and military officials, ambassadors and\nenvoys extraordinary and plenipotentiary.\nUpon the request of the Supreme Council of Magistracy,\nthe King shall sign the Royal Decree of appointment, transfer\nor dismissal of appointment, transfer or dismissal of magistrates."
                },
                {
                    "id": 22,
                    "tags": ["new"],
                    "content": "When the nation faces danger, the King shall make a public\nproclamation placing the country in a state of emergency, after\nunanimous agreement from the Prime Minister, the President\nof the National Assembly and the President of the Senate."
                },
                {
                    "id": 23,
                    "tags": [],
                    "content": "The King is the Supreme Commander of the Royal\nKhmer Armed Forces. A Commander-in-Chief of the Royal\nKhmer Armed Forces shall be appointed to command the\nArmed Forces."
                },
                {
                    "id": 24,
                    "tags": ["new"],
                    "content": "The King is the President of the Supreme Council of\nNational Defense which shall be created by a law.\nThe King declares war after the approval from the\nNational Assembly and the Senate."
                },
                {
                    "id": 25,
                    "tags": [],
                    "content": "The King receives credentials from ambassadors or\nenvoys extraordinary and plenipotentiary of foreign countries\naccredited to the Kingdom of Cambodia."
                },
                {
                    "id": 26,
                    "tags": ["new"],
                    "content": "The King signs and ratifies international treaties and\nconventions after their approval by the National Assembly and\nthe Senate."
                },
                {
                    "id": 27,
                    "tags": [],
                    "content": "The King holds the right of commuting court’s sentence and the power of pardon."
                },
                {
                    "id": 28,
                    "tags": ["new"],
                    "content": "The King signs the Kram promulgating the Constitution\nand the laws adopted by the National Assembly and thoroughly\nreviewed by the Senate, as well as the Kret upon the proposal\nfrom the Council of Ministers.\nIn case of illness and medical treatment abroad, the King\ncan delegate His power of signing the Kram and the Kret to the\nHead of State ad interim. This delegation of signature is express."
                },
                {
                    "id": 29,
                    "tags": ["new"],
                    "content": "The King creates and confers national honorific distinctions.\nThe King decides on granting military and civilian grades\nand titles in accordance with the law."
                },
                {
                    "id": 30,
                    "tags": ["new"],
                    "content": "During the absence of the King, the President of the\nSenate shall assume the duties of Head of State ad interim.\nIn case the President of the Senate cannot perform the\nduties of Head of State ad interim during the absence of\nthe King, these duties shall be assumed in conformity with\nparagraphs 2 and 3 of Article 11 new."
                }
            ]
        },
        {
            "id": 3,
            "title": "ON THE RIGHTS AND DUTIES OF KHMER CITIZENS",
            "articles": [
                {
                    "id": 31,
                    "tags": [],
                    "content": "The Kingdom of Cambodia recognizes and respects\nhuman rights as enshrined in the United Nations Charter, the\nUniversal Declaration of Human rights and all the treaties\nand conventions related to human rights, women’s rights and\nchildren’s rights.\nKhmer citizens are equal before the law, enjoying the\nsame rights, liberties and duties regardless of race, color, sex,\nlanguage, beliefs, religions, political tendencies, birth origin,\nsocial status, wealth or other situations. The exercise of personal\nrights and liberties by any individual shall not adversely affect\nthe rights and freedom of others. The exercise of such rights\nand liberties shall be in accordance with the law."
                },
                {
                    "id": 32,
                    "tags": [],
                    "content": "Every person has the right to life, liberty and personal security.\nDeath penalty shall not exist in any way."
                },
                {
                    "id": 33,
                    "tags": [],
                    "content": "Khmer citizens shall not be deprived of their nationality,\nexiled, or arrested to be extradited to a foreign country, except\nwhen there is a mutual agreement .\nKhmer citizens residing abroad are under the protection\nof the State.\nThe acquisition of Khmer nationality shall be determined\nby law."
                },
                {
                    "id": 34,
                    "tags": ["new", "one"],
                    "content": "Khmer citizens of both sexes shall enjoy the right to vote\nand to stand as candidates for the election.\nKhmer citizens of both sexes, at least eighteen years old,\nhave the right to vote.\nKhmer citizens of both sexes, at least twenty-five years\nold, have the right to stand as candidates for the elections of\nMembers of Parliament.\nKhmer citizens of both sexes, at least forty years old,\nhave the right to stand as candidates for the elections of the\nmembers of the Senate.\nProvisions depriving of the right to vote and the right to\nstand as candidates for the elections shall be determined by\nlaw."
                },
                {
                    "id": 35,
                    "tags": [],
                    "content": "Khmer citizens of both sexes have the right to participate\nactively in the political, economic, social and cultural life of\nthe nation.\nAll requests from citizens shall be given full consideration\nand resolution by the State’s organizations.\n"
                },
                {
                    "id": 36,
                    "tags": [],
                    "content": "Khmer citizens of both sexes have the right to choose any\nemployment according to their ability and to the needs of the\nsociety.\nKhmer citizens of both sexes shall receive equal pay for\nequal work.\nThe work of housewife at home shall have equal value as\nthe remunerated work done outside the home.\nKhmer citizens of both sexes shall have the right to enjoy\nsocial security and other social benefits as determined by law.\nKhmer citizens of both sexes shall have the right to create\ntrade unions and to participate as their members.\nThe organization and functioning of the trade unions\nshall be determined by law."
                },
                {
                    "id": 37,
                    "tags": [],
                    "content": "The rights to strike and to organize peaceful demonstrations\nshall be exercised within the framework of law."
                },
                {
                    "id": 38,
                    "tags": [],
                    "content": "The law guarantees against physical abuse of any person.\nThe law protects the life, the honor and the dignity of the\ncitizens.\nThe prosecution, arrest, police custody or detention of\nany person could be carried out only in accordance with the\nlaw.\nThe coercion, physical punishment or any other treatment\naggravating the penalty of the detainee or prisoner shall be\nforbidden. The author of such acts, co-authors and accomplices\nshall be punished according to the law.\nConfessions obtained by physical torture or mental\npressure shall not be admissible as evidence of guilt.\nThe doubt shall benefit the accused.\nAny accused is presumed innocent up to the final verdict\nof the court.\nAny individual shall have the right to his/her own defense\nthrough the judicial system."
                },
                {
                    "id": 39,
                    "tags": [],
                    "content": "Khmer citizens have the right to denounce, make\ncomplaints, or file claims for reparations of damages caused\nby any illegal actions by state and social organizations or by\nstaff of those organizations. The settlement of complaints and\nthe reparations of damages are of the competence of the courts."
                },
                {
                    "id": 40,
                    "tags": [],
                    "content": "Citizen’s freedom to travel, far or near, and to legally\nsettle down shall be respected.\nKhmer citizen has the right to settle abroad or to return\nhome.\nThe protection of the rights to the inviolability of residence\nand to the confidentiality of correspondences by mail, telegram,\ntelex, facsimile and telephone shall be guaranteed.\nSearch of residences, properties and body search shall be\ndone in accordance with the legal stipulations."
                },
                {
                    "id": 41,
                    "tags": [],
                    "content": "Khmer citizens shall have the freedom to express their\npersonal opinions, the freedom of the press, the freedom of\npublication and the freedom of assembly. No one can take\nabusively advantage of these rights to impinge on dignity\nof others, to affect the good mores and custom of society,\npublic order and national security.\nThe regime of the media shall be regulated by law."
                },
                {
                    "id": 42,
                    "tags": ["new"],
                    "content": "Khmer citizens shall have the right to create associations\nand political parties. This right shall be determined by law.\nPolitical party shall place the interest of the nation\nfirst and shall not conduct directly or indirectly any activity\naffecting the interest of the Kingdom of Cambodia and Khmer\ncitizens.\nKhmer citizens may participate in mass organizations\nfor mutual assistance, protection of national realizations and\nsocial order."
                },
                {
                    "id": 44,
                    "tags": [],
                    "content": "All persons, individually or collectively, shall have the\nright to ownership. Only natural person or legal entity of\nKhmer nationality shall have the right to land ownership.\nLegal private ownership shall be protected by law.\nExpropriation shall be possible only if public utility\ndemands in the cases stipulated by the law and if prior\nappropriate and fair compensation is granted."
                },
                {
                    "id": 45,
                    "tags": [],
                    "content": "All forms of discrimination against women shall be\nabolished.\nThe exploitation of women’s labor shall be prohibited.\nMen and women have equal rights in all fields, especially\nwith respect to those of marriage and family.\nMarriage shall be done according to the conditions set\nby the law and based on the principles of mutual consent and\nmonogamy."
                },
                {
                    "id": 46,
                    "tags": [],
                    "content": "Human trafficking, exploitation of prostitution and\nobscenities which affect the dignity of women shall be\nprohibited.\nThe dismissal of woman worker for reason of pregnancy\nshall be prohibited. Woman shall have the right to take maternity\nleave with full pay and with guarantee of her seniority in\nemployment and of other social benefits.\nThe State and the society shall create conditions to allow\nwomen, especially the destitute ones living in rural areas, to\nbenefit from assistance for having a profession, for medical cares,\nfor their children education and for decent living conditions."
                },
                {
                    "id": 47,
                    "tags": [],
                    "content": "Mother and father shall have the obligation to take care\nof their children, to bring them up and to educate them in order\nto become good citizens.\nChildren shall have the duty to attend to the needs of their\naged parents and to take good care of them in accordance with\nKhmer custom."
                },
                {
                    "id": 48,
                    "tags": [],
                    "content": "The State shall assure the protection of children’s rights as\nenshrined in the Convention on Children, especially, the right\nto life, the right to education, the right to protection during\nwartime and the right to protection from economic or sexual\nexploitation.\nThe State shall protect children from all kinds of labour\nthat can be detrimental to their education and their schooling,\nor to their health or their welfare."
                },
                {
                    "id": 49,
                    "tags": ["new"],
                    "content": "Every Khmer citizen shall respect the Constitution and\nthe laws.\nKhmer citizens shall place the interest of the nation\nfirst and shall not conduct directly or indirectly any activity\naffecting the interest of the Kingdom of Cambodia and Khmer\ncitizens.\nEvery Khmer citizen has the obligation to participate in\nthe national construction and to defend the motherland.\nThe obligation to defend the motherland shall be done in\naccordance with the provisions of the law."
                },
                {
                    "id": 50,
                    "tags": [],
                    "content": "Khmer citizens of both sexes shall respect the principles\nof national sovereignty and liberal multi-party democracy.\nKhmer citizens of both sexes shall respect public property\nand legitimate private property."
                }
            ]
        },
        {
            "id": 4,
            "title": "ON THE POLITICAL REGIME",
            "articles": [
                {
                    "id": 51,
                    "tags": ["new"],
                    "content": "The Kingdom of Cambodia implements a policy of liberal\nmulti-party democracy.\nKhmer citizens are masters of their country’s destiny.\nAll powers shall belong to the citizens. The citizens shall\nexercise their powers through the National Assembly, the\nSenate, the Royal Government and the Jurisdictions.\nThe powers shall be separated between the legislative\npower, the executive power and the judicial power."
                },
                {
                    "id": 52,
                    "tags": [],
                    "content": "The Royal Government of Cambodia shall commit\nitself resolutely to preserve and defend the independence,\nsovereignty, and territorial integrity of the Kingdom of\nCambodia, implement a policy of national reconciliation to\nensure national unity, and protect the good mores and custom\nof the nation. The Royal Government of Cambodia shall\ndefend the legality and ensure public order and security. The\nState shall give priority to the living conditions and welfare of\ncitizens."
                },
                {
                    "id": 53,
                    "tags": ["new"],
                    "content": "The Kingdom of Cambodia maintains resolutely a policy\nof permanent neutrality and non-alignment. The Kingdom of\nCambodia coexists peacefully with its neighbors and with all\nother countries throughout the world.\nThe Kingdom of Cambodia shall never invade any\ncountry, nor interfere in any other country’s internal affairs,\ndirectly or indirectly, and shall solve any problems peacefully\nwith due respect for mutual interests.\nThe Kingdom of Cambodia shall absolutely oppose any\nforeign interference in any form in its internal affairs.\nThe Kingdom of Cambodia shall not join in any military\nalliance, nor conclude any military agreement which is\nincompatible with its policy of neutrality.\nThe Kingdom of Cambodia shall not authorize any\nforeign military base on its territory, nor have its own military\nbases abroad, except within the framework of a United Nations\nrequest.\nThe Kingdom of Cambodia reserves the right to\nreceive foreign assistance in military equipment, armaments,\nammunition, in training of its armed forces, and other assistance\nfor self-defense and for ensuring public order and security\nwithin its territory."
                },
                {
                    "id": 54,
                    "tags": [],
                    "content": "The manufacture, use and storage of nuclear, chemical or\nbiological weapons shall be absolutely prohibited."
                },
                {
                    "id": 55,
                    "tags": [],
                    "content": "Any treaty and agreement incompatible with the\nindependence, sovereignty, territorial integrity, neutrality and\nnational unity of the Kingdom of Cambodia shall be abrogated."
                }
            ]
        }, {
            "id": 5,
            "title": "ON THE ECONOMY",
            "articles": [
                {
                    "id": 56,
                    "tags": [],
                    "content": "The Kingdom of Cambodia implements the market\neconomy system.\nThe organization and the functioning of this economic\nsystem shall be determined by the law."
                },
                {
                    "id": 57,
                    "tags": [],
                    "content": "Tax can be collected only when it is authorized by a\nlaw. The national budget shall be laid down and carried out in\naccordance with the law.\nThe monetary management and the financial system shall\nbe determined by the law."
                },
                {
                    "id": 58,
                    "tags": [],
                    "content": "State property notably consists of land, underground,\nmountains, sea, sea-bed, undersea-bed, coastline, airspace,\nislands, rivers, canals, streams, lakes, forests, natural resources,\neconomic and cultural centers, national defense bases, other\nbuilding facilities belonging to the State.\nThe administration, the utilization and the assignment of\nState’s properties shall be determined by the law."
                },
                {
                    "id": 59,
                    "tags": [],
                    "content": "The State shall preserve and protect the environment\nand the balance of natural resources, by organizing a precise\nplanning for the management, especially of the land, water,\natmosphere, air, geology, ecological systems, mines, energy,\npetroleum and gas, rocks, sand, gems, forests and forest by-\nproducts, wildlife, fish and aquatic resources."
                },
                {
                    "id": 60,
                    "tags": [],
                    "content": "Citizens have the right to freely sell and exchange their\nown products. The obligation to sell products to the State\nor the appropriation, even temporarily, of private riches or\npossessions by the State shall be prohibited, except under\nconditions specially authorized by the law."
                },
                {
                    "id": 61,
                    "tags": [],
                    "content": "The State shall promote economic development in\nall fields, especially in agriculture, handicraft, industry,\nto begin with the remotest areas, with concern for water\npolicy, electricity, roads and means of transportation, modern\ntechniques and credit system."
                },
                {
                    "id": 62,
                    "tags": [],
                    "content": "The State shall be concerned with resolving the means of\nproduction, sustaining the prices of agricultural and handicraft\nproducts, and helping find markets for these products to be\nsold."
                },
                {
                    "id": 63,
                    "tags": [],
                    "content": "The State shall attend to regulating the markets in order\nto secure a suitable living standard for the citizens."
                },
                {
                    "id": 64,
                    "tags": [],
                    "content": "The State shall forbid individuals to import, manufacture\nor sell illicit drugs, counterfeit products, expired goods harmful\nto the consumers’ health and life, and shall severely punish\nthem."
                }
            ]
        }, {
            "id": 6,
            "title": "ON THE EDUCATION, THE CULTURE AND THE SOCIAL AFFAIRS",
            "articles": [
                {
                    "id": 65,
                    "tags": [],
                    "contents": "The State shall protect and promote the right of the citizen to a quality education at all levels and shall take every measure to progressively make this education available to all the citizens. The State shall put emphasis on the field of physical education and sports for the benefit of all the Khmer citizens’ well-being."
                },
                {
                    "id": 66,
                    "tags": [],
                    "contents": "The State shall establish a comprehensive and unified system of education throughout the country, capable of guaranteeing the principles of freedom of education and equal access to schooling, in order to offer each citizen the equal opportunity for the betterment of his/her living conditions."
                },
                {
                    "id": 67,
                    "tags": [],
                    "contents": "The State implements a curriculum and modern pedagogic principles including the teaching of technology and foreign languages. The State shall oversee public and private educational establishments and classes at all cycles."
                },
                {
                    "id": 68,
                    "tags": [],
                    "contents": "The State shall ensure for all citizens free primary and secondary education at public schools. Citizens shall receive schooling for at least nine years. The State shall help propagate and promote the Pali schools and the Buddhist education."
                },
                {
                    "id": 69,
                    "tags": [],
                    "contents": "The State has the obligation to preserve and develop national culture. The State has the obligation to protect and develop the Khmer language according to the needs. The State has the obligation to preserve and protect the ancient monuments, antiques, and to restore the historical sites."
                },
                {
                    "id": 70,
                    "tags": [],
                    "contents": "Any offence affecting or relating to cultural heritage and artistic heritage shall be severely punished."
                },
                {
                    "id": 71,
                    "tags": [],
                    "contents": "The perimeter of national heritage sites as well as of those classified as world heritage sites shall be considered as neutral zone forbidden to any military activity."
                },
                {
                    "id": 72,
                    "tags": [],
                    "contents": "The health of the people shall be guaranteed. The State shall give full consideration to disease prevention and medical cares. Poor people shall receive free medical consultations in public hospitals, infirmaries and maternities. The State shall establish infirmaries and maternities in rural areas."
                },
                {
                    "id": 73,
                    "tags": [],
                    "contents": "The State shall give full consideration for children and mothers, by encouraging the creation of nurseries and by attending to women without support who have many children under their cares."
                },
                {
                    "id": 74,
                    "tags": [],
                    "contents": "The State shall provide assistance to the disabled persons and to the families of combatants who sacrificed their lives for the nation."
                },
                {
                    "id": 75,
                    "tags": [],
                    "contents": "The State shall establish a social security regime for workers and employees."
                }
            ]
        }, {
            "id": 7,
            "title": "ON THE NATIONAL ASSEMBLY",
            "articles": [
                {
                    "id": 76,
                    "tags": ["new"],
                    "content": "The National Assembly shall comprise at least 120 members. The Members of the National Assembly shall be elected by a universal, free, equal, direct suffrage and secret ballot. The National Assembly’s Members are re-eligible. Khmer citizens of both sexes, enjoying the right to vote, aged at least 25 years and having Khmer nationality by birth, have the right to be candidates to the National Assembly. The modalities and functioning of the elections shall be determined by the electoral law."
                },
                {
                    "id": 77,
                    "tags": [],
                    "content": "The Members of the National Assembly are the representatives of the whole Khmer Nation and not of the only citizens from their constituencies. Any imperative mandate shall be considered as null."
                },
                {
                    "id": 78,
                    "tags": [],
                    "content": "The legislature of the National Assembly is of 5 years and shall terminate on the day of the new National Assembly entering in function. The National Assembly cannot be dissolved before the end of its mandate, except in the case when the Royal Government has been voted out twice within a period of 12 months. In this case, the King shall, on the proposal from the Prime Minister and with the approval of the President of the National Assembly, dissolve the National Assembly. The election of the new National Assembly shall take place at the latest within 60 days, counting from the date of dissolution of the National Assembly. During this period, the Royal Government is only in charge of the day-to-day affairs. In time of war or in other exceptional circumstances when it is impossible to organize the elections, the National Assembly may, on the proposal from the King, declare the prorogation of its mandate for one year each time. The declaration on the extension of the National Assembly’s mandate must be adopted by at least two-third of all its Members."
                },
                {
                    "id": 79,
                    "tags": [],
                    "content": "The mandate of the Member of the National Assembly is incompatible with the active functions in the civil service and with the functions as member of any other institution stipulated in the Constitution, except those exercised in the Council of Ministers of the Royal Government. In this case, the concerned Member of the National Assembly keeps the quality as an ordinary Member of the National Assembly, but he/she must have no position in the Standing Committee and in the different Commissions of the National Assembly."
                },
                {
                    "id": 80,
                    "tags": [],
                    "content": "Members of the National Assembly shall enjoy parliamentary immunity. No National Assembly’s Member can in any case be prosecuted, arrested, kept in police custody or detained because of his/her opinions or views expressed during the exercise of his/her functions. The prosecution against, the arrest, the police custody or the detention of any Member of the National Assembly is possible only when approved by the National Assembly or by the Standing Committee during the interval between sessions, except in flagrante delicto case. In this last case, the competent ministry must urgently report to the National Assembly or to the Standing Committee for decision. The decision of the National Assembly’s Standing Committee must be submitted to the next session of the National Assembly for adoption by two-third majority of all its Members. In all the aforementioned cases, the detention of, the prosecution against any National Assembly’s Member shall be suspended, if the National Assembly so decided by three-forth majority of all its Members."
                },
                {
                    "id": 81,
                    "tags": [],
                    "content": "The National Assembly shall have an autonomous budget for its functioning. The National Assembly’s Members shall receive allowances."
                },
                {
                    "id": 82,
                    "tags": ["new"],
                    "content": "The first session of the National Assembly shall open sixty days at the latest after the elections, upon convocation by the King. Before starting its works, the National Assembly shall declare the validity of each Member’s mandate and shall vote separately to elect its President, its Vice-Presidents and all the Members of its various Commissions, by an absolute majority of all its Members. The President of the National Assembly is elected from among its members and shall have only one Khmer nationality. The National Assembly shall adopt its Rules of Procedure by an absolute majority of all its Members. Before taking office, all the National Assembly’s Members shall take the oath according to the text written in Annex 5 of the Constitution."
                },
                {
                    "id": 83,
                    "tags": [],
                    "content": "The National Assembly shall convene in ordinary session twice a year. Each session shall last at least three months. Upon the request from the King or upon the proposal of the Prime Minister or of at least one-third of the National Assembly’s Members, the Standing Committee of the National Assembly shall convene an extraordinary session of the National Assembly. In this case, the precise agenda of the extraordinary session and the date of this session must be brought to the knowledge of the people."
                },
                {
                    "id": 84,
                    "tags": [],
                    "content": "During the interval between the Sessions of the National Assembly, its Standing Committee shall be in charge of the functioning of the National Assembly. The Standing Committee shall be composed of the President of the National Assembly, the Vice-Presidents of the National Assembly, and the Presidents of all the Commissions of the National Assembly."
                },
                {
                    "id": 85,
                    "tags": [],
                    "content": "The meetings of the National Assembly shall take place in the Capital City of the Kingdom of Cambodia, at the National Assembly Meeting Hall, except a decision otherwise specified in the convocation letter for circumstantial reasons. Apart from the aforementioned cases and apart from the location and the date specified in the convocation letter, any other mettings of the National Assembly shall be considered illegal and null in its own full right."
                },
                {
                    "id": 86,
                    "tags": [],
                    "content": "Under the circumstances when the nation is in a state of emergency, the National Assembly shall convene every day, in permanence. The National Assembly has the right to put an end to the aforementioned special circumstances, whenever the situation permits. If the National Assembly cannot convene for imperative reasons, notably in case of territorial occupation by foreign forces, the declaration of the state of emergency must be automatically extended. During the period when the nation is in a state of emergency, the National Assembly cannot in any case be dissolved."
                },
                {
                    "id": 87,
                    "tags": [],
                    "content": "The President of the National Assembly presides over the National Assembly sessions, takes cognizance of the laws and the resolutions adopted by the National Assembly, ensures the implementation of the Rules of Procedure and organizes the international relations of the National Assembly. In case the President of the National Assembly is prevented from performing his/her duties for health reason, or for assuming his/her functions as Head of State ad interim or as Regent, or for being on mission abroad, a Vice-President shall replace him/her. In case of resignation or decease of the President or of the Vice-Presidents, the National Assembly shall elect a new President or new Vice-Presidents."
                },
                {
                    "id": 88,
                    "tags": ["new", "two"],
                    "content": "The National Assembly sessions shall be public. The National Assembly can convene in camera at the request of the President or of at least one-tenth of its Members, of the King or of the Prime Minister. The session of the National Assembly is only valid, when there is: a- the quorum of over two-third of all its Members for the votes requiring the majority of two-third of all its Members. b- the quorum of over half of all its Members for the votes requiring the absolute majority of all its Members."
                },
                {
                    "id": 89,
                    "tags": ["new"],
                    "content": "At the request of at least one-tenth of its Members, the National Assembly can invite one or more government members accompanied by expert personalities from any field to clarify to the National Assembly on an issue of particular importance."
                },
                {
                    "id": 90,
                    "tags": ["new", "two"],
                    "content": "The National Assembly is an organ vested with legislative power which exercises its functions according to the provisions of the Constitution and the laws in force. The National Assembly votes on the national budget, the State planning, the State borrowings and lending, the various pledges of financial warranties, and the creation, modification or abolition of taxes. The National Assembly approves the administrative account. The National Assembly votes the amnesty law. The National Assembly votes the approval or the abrogation of international treaties or conventions. The National Assembly votes the law on war declaration. The aforementioned votes must be approved by an absolute majority of all the National Assembly’s Members. The National Assembly grants a vote of confidence to the Royal Government at the absolute majority of all its Members."
                },
                {
                    "id": 91,
                    "tags": ["new"],
                    "content": "The Senators, the National Assembly’s Members and the Prime Minister have the initiative of laws. The National Assembly’s Members have the right to propose amendments to the laws, but this proposal is not acceptable if those amendments aim to reduce public incomes or to increase the burden on the citizens."
                },
                {
                    "id": 92,
                    "tags": [],
                    "content": "Any adoption by the National Assembly contrary to the principles of safeguarding the independence, the sovereignty, the territorial integrity of the Kingdom of Cambodia, and affecting the political unity or the administrative management of the nation, must be considered null and void. The Constitutional Council is the sole organ competent to pronounce this nullity."
                },
                {
                    "id": 93,
                    "tags": ["new"],
                    "content": "The law adopted by the National Assembly and definitively reviewed by the Senate, and promulgated by the King, shall come into force in the capital city of Phnom Penh within ten clear days counting from the date of promulgation, and throughout the country within twenty clear days counting from the date of promulgation. However, if the law is declared urgent, it shall come immediately into force on the whole territory of the country as counting from the date of promulgation. The law signed and promulgated by the King shall be published in the Royal Gazette and shall be circulated on the whole territory of the country in the time limit as set above."
                },
                {
                    "id": 94,
                    "tags": [],
                    "content": "The National Assembly creates various necessary commissions. The organization and the functioning of the National Assembly shall be stipulated in the National Assembly’s Rules of Procedure."
                },
                {
                    "id": 95,
                    "tags": [],
                    "content": "In case of decease, resignation or loss of membership of a National Assembly’s Member, which could happen at least six months before the end of the mandate, the replacement must proceed in the conditions set by the National Assembly’s Rules of Procedure and by the Electoral Law."
                },
                {
                    "id": 96,
                    "tags": [],
                    "content": "The National Assembly’s Members have the right to raise questions to the Royal Government. The questions must be put in writing and transmitted through the President of the National Assembly. The answers shall be given by one or several ministers depending on whether the raised issue comes under the responsibility of one or several ministers. If the issue concerns the general policy of the Royal Government, the Prime Minister shall reply in person. The answers by the minister or by the Prime Minister may be in a verbal or written form. The above answers shall be given within seven days after receiving the questions. In case of verbal answer, the President of the National Assembly can decide whether to open the debate or not. If he does not authorize the debate, the answers of the minister or the Prime Minister put an end to the raised questions. If he authorizes the opening of a debate, the authors of the questions, the other orators, the concerned minister or the Prime Minister can discuss and exchange the points of view within a time-frame that cannot exceed one meeting. The National Assembly shall reserve one day a week for questions time. The meetings reserved for the questions and answers cannot in any case be open to any vote."
                },
                {
                    "id": 97,
                    "tags": [],
                    "content": "The Commissions of the National Assembly can invite ministers to give clarifications on issue relating to their responsibility."
                },
                {
                    "id": 98,
                    "tags": ["new", "one"],
                    "content": "The National Assembly can dismiss a Member of the Royal Government or overthrow the Royal Government by voting a motion of censure at the absolute majority of all its members. In case the Royal Government is overthrown by the National Assembly, the outgoing Royal Government shall only have the duty to lead daily work until a new government comes into office. The motion of censure against the Royal Government must be submitted to the National Assembly by one-third of all its members before the motion of censure can be examined."
                }
            ]
        }, {
            "id": 8,
            "title": "ON THE SENATE",
            "articles": [
                {
                    "id": 99,
                    "tags": ["new"],
                    "content": "The Senate is an organ vested with legislative power which exercises its functions according to the provisions of the Constitution and the laws in force. The number of the Senators must not exceed half of the total number of the National Assembly’s Members. The Senate is composed of appointed members and members elected at restricted suffrage. The Senators can be appointed a new or re-eligible. Can be candidates to the Senate, Khmer citizens of both sexes enjoying the right to vote, aged 40 years at least and having Khmer nationality by birth."
                },
                {
                    "id": 100,
                    "tags": ["new"],
                    "content": "Two Senators are appointed by the King. Two Senators are elected by the National Assembly at a relative majority vote. The other Senators are elected at a restricted suffrage."
                },
                {
                    "id": 101,
                    "tags": ["new"],
                    "content": "The modalities of the organization and the functioning of the appointment and the elections of the Senators as well as the determination of the voters, the electoral colleges and the electoral constituencies must be determined by a law."
                },
                {
                    "id": 102,
                    "tags": ["new"],
                    "content": "The mandate of the Senate is 6 years and shall terminate on the day the new Senate enters in function. In time of war or in other exceptional circumstances, when it is impossible to organize the elections, the Senate may, on the proposal of the King, declare the prorogation of its mandate for one year each time. The declaration of prorogation of the Senate’s mandate must be adopted by at least two-thirds of all the Senators. Under the aforementioned circumstances, the Senate shall convene every day, in permanence. The Senate has the right to put an end to the aforementioned special circumstances, whenever the situation permits. But, the decision to put an end to the special circumstances when the country is in a state of emergency, must be taken jointly by the Senate and the National Assembly during a Congress of the National Assembly and the Senate except the application of article 86 of the Constitution. If the Senate cannot convene for imperative reasons, notably in case of territorial occupation by foreign forces, the declaration of"
                },
                {
                    "id": 103,
                    "tags": ["new"],
                    "content": "The Senator’s mandate is incompatible with actively exercising any public function, with the functions as the National Assembly’s Member and with those as member of another institution stipulated in the Constitution."
                },
                {
                    "id": 104,
                    "tags": ["new"],
                    "content": "The Senators shall enjoy parliamentary immunity. No Senator can in any case be prosecuted, arrested, kept in police custody or detained because of his/her opinions or of the votes expressed during the exercise of his/her functions. The prosecution against, the arrest, the police custody or the detention of a Senator is possible only when approved by the Senate or by the Standing Committee during the interval between sessions, except in flagrante delicto case. In this last case, the competent ministry must urgently report to the Senate or to the Standing Committee for decision. The decision of the Senate’s Standing Committee must be submitted to the next session of the Senate for adoption by two-third majority of all the Senators. In all the aforementioned cases, the detention of, the prosecution against any Senator shall be suspended, if the Senate so decides by three-forth majority of all the Senators."
                },
                {
                    "id": 105,
                    "tags": ["new"],
                    "content": "The Senate shall have an autonomous budget for its functioning. The Senators shall receive allowances."
                },
                {
                    "id": 106,
                    "tags": ["new", "two"],
                    "content": "The first session of the Senate shall open sixty days at the latest after the elections, upon convocation by the King. Before starting its works, the Senate shall declare the validity of each Senator’s mandate and shall vote separately to elect its President, its Vice-Presidents and all the Members of its various Commissions, by an absolute majority of all the Senators. The President of the Senate is elected from among its members and shall have only one Cambodian nationality. Before taking office, all the Senators shall take the oath according to the text written in Annex 7 of the Constitution."
                },
                {
                    "id": 107,
                    "tags": ["new"],
                    "content": "The Senate shall convene in ordinary sessions twice a year. Each Session shall last at least three months. Upon the request from the King or upon the proposal of the Prime Minister or of at least one-third of the Senators, the Senate shall convene in an extraordinary meeting."
                },
                {
                    "id": 108,
                    "tags": ["new"],
                    "content": "During the interval between the Sessions of the Senate, its Standing Committee shall be in charge of the functioning of the Senate. The Standing Committee shall be composed of the President of the Senate, the Vice-Presidents of the Senate and the Presidents of all the Commissions of the Senate."
                },
                {
                    "id": 109,
                    "tags": ["new"],
                    "content": "The sessions of the Senate shall take place in the Capital City of the Kingdom of Cambodia, at the Senate Meeting Hall, except a decision otherwise specified in the convening act for circumstantial reasons. Apart from the aforementioned cases and apart from the location and the date specified in the convening act, any session of the Senate shall be considered illegal and null in its own full right."
                },
                {
                    "id": 110,
                    "tags": ["new"],
                    "content": "The President of the Senate presides over the Senate sessions, takes cognizance of the laws and the resolutions adopted by the Senate, ensures the implementation of the Rules of Procedure and organizes the international relations of the Senate. In case the President of the Senate is prevented from performing his/her duties for health reason, or for assuming his/her functions as Head of State ad interim or as Regent, or for being on mission abroad, a Vice-President shall replace him/her. In case of resignation or decease of the President or of the Vice-Presidents, the Senate shall elect a new President or new Vice-Presidents."
                },
                {
                    "id": 111,
                    "tags": ["new", "two"],
                    "content": "The Senate sessions shall be public. The Senate can convene in camera at the request of the President or of at least one-tenth of its Members, at the request of the King, of the Prime Minister or of the President of the National Assembly. The session of the Senate is only valid, when there is: a- the quorum of over two-third of all its Members for the votes requiring the majority of two-third of all its Members. b- the quorum of over half of all its Members for the votes requiring the relative or absolute majority of all its Members. The number of votes required for the adoption by the National Assembly, as provided in this Constitution, shall also apply to the adoption by the Senate."
                },
                {
                    "id": 112,
                    "tags": ["new"],
                    "content": "The Senate has duty to coordinate the work between the National Assembly and the Government."
                },
                {
                    "id": 113,
                    "tags": ["new"],
                    "content": "The Senate shall examine and give its views on draft law or on proposed law adopted by the National Assembly in its first reading, as well as all the questions submitted by the National Assembly, within a period not exceeding one month. in case of urgency, this time frame shall be reduced to five days. If the Senate gives a favorable view, or gives no view, within the provided time limits, the law already adopted by the National Assembly will be submitted for promulgation. If the Senate proposes amendments to these draft laws or these proposed laws, the National Assembly shall immediately examine them in a second reading. The National Assembly shall decide on the sole amendments proposed by the Senate, either by accepting or rejecting them, in totality or in part. A shuttle between the Senate and the National Assembly shall proceed within a limited time frame of one month. This time frame shall be reduced to ten days for the budgetary texts and the laws on finances, and to two days in case of urgency declaration. If the National Assembly exceeds or extends the time frame at its disposal for examination, the time frame by principle allocated for agreement between the two Chambers is increased as much. In case the Senate purely and simply rejects them, the draft laws or the proposed laws cannot be examined by the National Assembly in a second reading, before a time frame of one month. This time frame is reduced to fifteen days for budgetary texts and the laws on finances, and to four days in case of urgency declaration. When examining the draft laws or the proposed laws in a second reading, the National Assembly shall adopt them by open ballot and at the absolute majority of all its Members. The draft laws or the proposed laws, once adopted according to aforementioned modalities, are submitted for promulgation."
                },
                {
                    "id": 114,
                    "tags": ["new", "one"],
                    "content": "The Senate creates various necessary commissions. The organization and the functioning of the Senate shall be stipulated in the Senate’s Rules of Procedure. These Rules of Procedure are adopted by an absolute majority of all its Members."
                },
                {
                    "id": 115,
                    "tags": ["new"],
                    "content": "In case of decease, resignation or loss of membership of a Senator, which could happen at least six months before the end of the mandate, the replacement must proceed in the conditions set by the Senate’s Rules of Procedure and by the law pertaining to the appointment and the elections of the Senators."
                }
            ]
        },
         {
            "id": 9,
            "title": "ON THE CONGRESS OF THE NATIONAL ASSEMBLY AND THE SENATE",
            "articles": [
                {
                    "id": 116,
                    "tags": ["new"],
                    "content": "In case of necessity, the National Assembly and the Senate can convene in Congress to resolve the important issues of the country."
                },
                {
                    "id": 117,
                    "tags": ["new"],
                    "content": "The important issues of the country as provided in the above-mentioned Article 116 new, as well as the organization and functioning of the Congress shall be determined by a law."
                }
            ]
        },
        {
            "id": 10,
            "title": "ON THE ROYAL GOVERNMENT",
            "articles": [
                {
                    "id": 118,
                    "tags": ["new", "one"],
                    "content": "The Council of Ministers is the Royal Government of the Kingdom of Cambodia. The Council of Ministers shall be headed by a Prime Minister, assisted by Deputy Prime Ministers as well by Senior Ministers and Ministers as members."
                },
                {
                    "id": 119,
                    "tags": ["new", "two"],
                    "content": "On the proposal of the party with the most seats in the National Assembly, the King appoints a high-ranking personality as Prime Minister to form the Royal Government. This proposal from the party with the most seats in the National Assembly must be copied to the President of the National Assembly. The high-ranking personality appointed as Prime Minister must be a Member of the National Assembly holding only one Khmer nationality and be chosen from the party with the most seats in the National Assembly. This assigned high- ranking personality, accompanied by his collaborators who are Members of the National Assembly or Members of the parties represented at the National Assembly and who are in charge of ministerial functions within the Royal Government, solicits the confidence from the National Assembly. The vote of confidence must be done to the list of composition of the Council of Ministers. Once the National Assembly has voted the confidence, the King signs a Royal Decree appointing the whole Council of Ministers. Before taking office, the Council of Ministers shall take the oath according to the text written in Annex 6. At the end of each legislature of the National Assembly, the outgoing Royal Government has only duty on daily work until a new Royal Government takes office."
                },
                {
                    "id": 120,
                    "tags": ["new","(former Article 101)"],
                    "content": "The function of Member of the Royal Government is incompatible with any professional activity in the field of trade or industry and with the holding of any position in the civil service."
                },
                {
                    "id": 121,
                    "tags": ["new","(former Article 102)"],
                    "content": "All the Members of the Royal Government are collectively responsible to the National Assembly for the general policy of the Royal Government. Each Member of the Royal Government is individually responsible to the Prime Minister and to the National Assembly for his/her own actions."
                },
                {
                    "id": 122,
                    "tags": ["new","(former Article 103)"],
                    "content": "The Members of the Royal Government cannot resort to a written or verbal order from whomever to decline their own responsibility."
                },
                {
                    "id": 123,
                    "tags": ["new","(former Article 104)"],
                    "content": "The Council of Ministers shall convene every week in plenary session or in working session. The plenary session is chaired by the Prime Minister. The Prime Minister can delegate to a Deputy Prime Minister the chairmanship of the working sessions. All the minutes of the Council of Ministers’ sessions shall be submitted to the King for His highest information."
                },
                {
                    "id": 124,
                    "tags": ["new","(former Article 105)"],
                    "content": "The Prime Minister can delegate his/her powers to a Deputy Prime Minister or to a Member of the Royal Government."
                },
                {
                    "id": 125,
                    "tags": ["new","one"],
                    "content": "In case of a temporary absence of the Prime Minister, the Prime Minister shall assign one Deputy Prime Minister to be an Acting Prime Minister to temporarily lead the Council of Ministers. in case of definitive vacancy in the post of Prime Minister, notably due to decease or resignation, a new Council of Ministers must be immediately appointed in accordance with the conditions stipulated in this Constitution. The president of the National Assembly must immediately call for a National Assembly meeting and take other necessary measures within seven days at the latest after receiving a proposal from the party having the majority of the seats in the National Assembly. in case of definitive vacancy in the post of Prime Minister, due to decease or resignation, the outgoing Council of Ministers, under the leadership of a Deputy Prime Minister who was assigned as Acting Prime Minister has only the duty of the daily work until a new Council of Ministers takes office. The letter of resignation from the post of Prime Minister must be sent to the King, and copied for the President of the National Assembly. In this case, the outgoing Council of Ministers must continue to conduct the work of the Royal Government until the new Council of Ministers takes office."
                },
                {
                    "id": 126,
                    "tags": ["new","(former Article 107)"],
                    "content": "Members of the Royal Government hold penal responsibility for the major or minor offences while performing their functions. In this case and in the case of serious misdeeds committed by a Member of Royal Government while performing his/ her functions, the National Assembly can decide to seize the competent jurisdictions. The National Assembly shall decide on such matter in a secret ballot by an absolute majority of all its Members."
                },
                {
                    "id": 127,
                    "tags": ["new","(former Article 108)"],
                    "content": "The organization and functioning of the Council of Ministers are stipulated by a law."
                }
            ]
        },
        {
            "id": 11,
            "title": "ON THE JUDICIARY",
            "articles": [
                {
                    "id": 128,
                    "tags": ["new", "former Article 109"],
                    "content": "The Judicial power is an independent power. The Judicial power is the guarantor of impartiality and the protector of the citizens’ rights and liberties. The Judicial power covers all litigations, including administrative litigation. This power is entrusted to the Supreme Court and to the Jurisdictions of the various categories and at all the degrees."
                },
                {
                    "id": 129,
                    "tags": ["new", "former Article 110"],
                    "content": "Justice is rendered in the name of Khmer people in accordance with the legal procedures and the laws in force. Only the judges are vested with the judicial function. The judges shall fulfill their duties in strict respect of the law, in all honesty and conscientiousness."
                },
                {
                    "id": 130,
                    "tags": ["new", "former Article 111"],
                    "content": "No organ of the Legislative Power or of the Executive Power can exercise any judicial power."
                },
                {
                    "id": 131,
                    "tags": ["new", "former Article 112"],
                    "content": "Only the public prosecution has the right to take public action."
                },
                {
                    "id": 132,
                    "tags": ["new", "former Article 113"],
                    "content": "The King is the Guarantor of the independence of the Judiciary. The Supreme Council of Magistracy assists the King in this task."
                },
                {
                    "id": 133,
                    "tags": ["new", "former Article 114"],
                    "content": "The Magistrates are irremovable. However, the Supreme Council of Magistracy shall pronounce disciplinary sanctions against the Magistrates committing misdeeds."
                },
                {
                    "id": 134,
                    "tags": ["new", "former Article 115"],
                    "content": "The Supreme Council of Magistracy shall be created by an Organic Law which determines its composition and attributions. The Supreme Council of Magistracy is placed under the Presidency of the King. The King can designate His Representative to preside over the Supreme Council of Magistracy. The Supreme Council of Magistracy submits to the King the proposal for appointment of judges and public prosecutors to all the Jurisdictions. To decide disciplinary sanctions against the judges and the public prosecutors, the Supreme Council of Magistracy convenes under the presidency of the Supreme Court’s President or of the General Public Prosecutor to the Supreme Court, whether the case relates to the judges or the public prosecutors."
                },
                {
                    "id": 135,
                    "tags": ["new", "former Article 116"],
                    "content": "The statutes of judges and public prosecutors and the judicial organization shall be stipulated in separate laws."
                },
            ]
        }
    ]
}