{
    "metadata": {
        "document_date": "07/24/2017",
        "document_source": "https://ccc.gov.kh/detail_info_en.php?_txtID=791"
    },

    "chapters": [
        {
            "id": 1,
            "title": "ON THE SOVEREIGNTY",
            "articles": [
                {
                    "id": 1,
                    "content": "Cambodia is a Kingdom where the King shall fulfill His\nfunctions according to the Constitution and the principles of\nliberal multi-party democracy.\nThe Kingdom of Cambodia is an independent, sovereign,\npeaceful, permanently neutral and non-aligned State."
                },
                {
                    "id": 2,
                    "content": "The territorial integrity of the Kingdom of Cambodia\nshall be absolutely inviolable within its borders as defined in\nthe 1/100,000 scale map made between the years 1933-1953,\nand internationally recognized between the years 1963 - 1969."
                },
                {
                    "id": 3,
                    "content": "The Kingdom of Cambodia is an indivisible State."
                },
                {
                    "id": 4,
                    "content": "The motto of the Kingdom of Cambodia is: Nation, Religion, King."
                },
                {
                    "id": 5,
                    "content": "The official language and script are those in Khmer."
                },
                {
                    "id": 6,
                    "content": "Phnom Penh is the capital city of the Kingdom of\nCambodia.\nThe national flag, anthem and coat of arms are defined in\nAnnexes 1, 2 and 3."
                }
            ]
        },
        {
            "id": 2,
            "title": "ON THE KING",
            "articles": [
                {
                    "id": 7,
                    "content": "The King of Cambodia shall reign, but not govern.\nThe King is the Head of State for life.\nThe Person of the King shall be inviolable."
                },
                {
                    "id": 8,
                    "content": "The King shall incarnate the symbol of national unity and\ncontinuity.\nThe King shall be the guarantor of the national\nindependence, the sovereignty and the territorial integrity of\nthe Kingdom of Cambodia, and the guarantor for the respect of\ncitizens’ rights and freedom, and of international treaties."
                },
                {
                    "id": 9,
                    "content": "The King shall assume the role as supreme arbiter to\nensure the regular functioning of public powers."
                },
                {
                    "id": 10,
                    "content": "The Cambodian monarchy is an elective monarchy.\nThe King has no power to appoint a heir to the throne."
                },
                {
                    "id": 11,
                    "tags": ["new"],
                    "content": "in case the King cannot as usual perform His duties of\nHead of State for being seriously ill, as certified by a team\nof specialized medical doctors chosen by the President of the\nSenate, the President of the National Assembly and the Prime\nMinister, the President of the Senate shall perform the duties of\nHead of State as Regent in His stead.\nIn case the President of the Senate cannot perform\nhis duties of Head of State in the stead of the King, acting\nas Regent, while the King is seriously ill as stipulated in the\naforementioned paragraph, the President of the National\nAssembly shall perform these duties.\nIn the case stated in the aforementioned paragraph, other\ndignitaries in the following hierarchy can perform the role of\nRegent as Acting Head of State:\na - First Vice-President of the Senate\nb - First Vice-President of the National Assembly\nc - Second Vice-President of the Senate\nd - Second Vice-President of the National Assembly"
                },
                {
                    "id": 12,
                    "tags": ["new"],
                    "content": "At the decease of the King, the President of the Senate\nshall perform the role of Head of State ad interim in his capacity\nas Regent of the Kingdom of Cambodia.\nIn case the President of the Senate cannot perform his\nduties of Head of Statead interim in his capacity as Regent,\nthe paragraphs 2 and 3 of Article 11 new must be implemented."
                },
                {
                    "id": 13,
                    "tags": ["new"],
                    "content": "Within a period not exceeding seven days, the new King\nof Cambodia shall be elected by the Crown Council.\nThe members of the Crown Council shall be composed\nof:\n-The President of the Senate\nUnofficial Translation\n7\n-The President of the National Assembly\n-The Prime Minister\n-The Supreme Patriarchs of the two religious orders,\nMahanikaya and Dhammayutikanikaya\n-The First and Second Vice-Presidents of the Senate\n- The First and Second Vice-Presidents of the National\nAssembly\nThe organization and functioning of the Crown Council\nshall be determined by law."
                },
                {
                    "id": 14,
                    "content": "Shall be elected King of Cambodia, a member of the\nRoyal family, aged at least 30 years, descendant of King Ang\nDuong or of King Norodom or also of King Sisowath.\nBefore ascending the throne, the King shall take oath as\nstipulated in Annex 4."
                },
                {
                    "id": 15,
                    "content": "The Consort of the King shall have the title of Queen of\nthe Kingdom of Cambodia."
                },
                {
                    "id": 16,
                    "content": "The Queen of the Kingdom of Cambodia shall have no\nright to engage in politics, to assume a leading function in State or\nGovernment affairs, or to assume an administrative or political\nrole.\nThe Queen of the Kingdom of Cambodia shall devote\nherself to tasks of social, humanitarian, religious interests, and\nassist the King in protocol and diplomatic duties."
                },
                {
                    "id": 17,
                    "content": "The provision, in which the King shall reign but\nnot govern, as stipulated in Article 7 paragraph 1 of this\nConstitution, cannot in any case be modified."
                },
                {
                    "id": 18,
                    "tags": ["new"],
                    "content": "The King communicates with the Senate and the National\nAssembly through royal messages.\nThese royal messages cannot be subject to debate at the\nSenate and the National Assembly"
                },
                {
                    "id": 19,
                    "tags": ["new", "two"],
                    "content": "The King shall appoint the Prime Minister and the Council\nof Ministers in accordance with the procedures stipulated in\nArticle 119 new (two)."
                },
                {
                    "id": 20,
                    "tags": [],
                    "content": "The King grants official audiences twice a month to the\nPrime Minister and the Council of Ministers to report to Him\non the situation of the country."
                },
                {
                    "id": 21,
                    "tags": [],
                    "content": "Upon the request of the Council of Ministers, the King\nshall sign the Royal Decree of appointment, transfer or dismissal\nof high-ranking civil and military officials, ambassadors and\nenvoys extraordinary and plenipotentiary.\nUpon the request of the Supreme Council of Magistracy,\nthe King shall sign the Royal Decree of appointment, transfer\nor dismissal of appointment, transfer or dismissal of magistrates."
                },
                {
                    "id": 22,
                    "tags": ["new"],
                    "content": "When the nation faces danger, the King shall make a public\nproclamation placing the country in a state of emergency, after\nunanimous agreement from the Prime Minister, the President\nof the National Assembly and the President of the Senate."
                },
                {
                    "id": 23,
                    "tags": [],
                    "content": "The King is the Supreme Commander of the Royal\nKhmer Armed Forces. A Commander-in-Chief of the Royal\nKhmer Armed Forces shall be appointed to command the\nArmed Forces."
                },
                {
                    "id": 24,
                    "tags": ["new"],
                    "content": "The King is the President of the Supreme Council of\nNational Defense which shall be created by a law.\nThe King declares war after the approval from the\nNational Assembly and the Senate."
                },
                {
                    "id": 25,
                    "tags": [],
                    "content": "The King receives credentials from ambassadors or\nenvoys extraordinary and plenipotentiary of foreign countries\naccredited to the Kingdom of Cambodia."
                },
                {
                    "id": 26,
                    "tags": ["new"],
                    "content": "The King signs and ratifies international treaties and\nconventions after their approval by the National Assembly and\nthe Senate."
                },
                {
                    "id": 27,
                    "tags": [],
                    "content": "The King holds the right of commuting court’s sentence and the power of pardon."
                },
                {
                    "id": 28,
                    "tags": ["new"],
                    "content": "The King signs the Kram promulgating the Constitution\nand the laws adopted by the National Assembly and thoroughly\nreviewed by the Senate, as well as the Kret upon the proposal\nfrom the Council of Ministers.\nIn case of illness and medical treatment abroad, the King\ncan delegate His power of signing the Kram and the Kret to the\nHead of State ad interim. This delegation of signature is express."
                },
                {
                    "id": 29,
                    "tags": ["new"],
                    "content": "The King creates and confers national honorific distinctions.\nThe King decides on granting military and civilian grades\nand titles in accordance with the law."
                },
                {
                    "id": 30,
                    "tags": ["new"],
                    "content": "During the absence of the King, the President of the\nSenate shall assume the duties of Head of State ad interim.\nIn case the President of the Senate cannot perform the\nduties of Head of State ad interim during the absence of\nthe King, these duties shall be assumed in conformity with\nparagraphs 2 and 3 of Article 11 new."
                }
            ]
        },
        {
            "id": 3,
            "title": "ON THE RIGHTS AND DUTIES OF KHMER CITIZENS",
            "articles": [
                {
                    "id": 31,
                    "tags": [],
                    "content": "The Kingdom of Cambodia recognizes and respects\nhuman rights as enshrined in the United Nations Charter, the\nUniversal Declaration of Human rights and all the treaties\nand conventions related to human rights, women’s rights and\nchildren’s rights.\nKhmer citizens are equal before the law, enjoying the\nsame rights, liberties and duties regardless of race, color, sex,\nlanguage, beliefs, religions, political tendencies, birth origin,\nsocial status, wealth or other situations. The exercise of personal\nrights and liberties by any individual shall not adversely affect\nthe rights and freedom of others. The exercise of such rights\nand liberties shall be in accordance with the law."
                },
                {
                    "id": 32,
                    "tags": [],
                    "content": "Every person has the right to life, liberty and personal security.\nDeath penalty shall not exist in any way."
                },
                {
                    "id": 33,
                    "tags": [],
                    "content": "Khmer citizens shall not be deprived of their nationality,\nexiled, or arrested to be extradited to a foreign country, except\nwhen there is a mutual agreement .\nKhmer citizens residing abroad are under the protection\nof the State.\nThe acquisition of Khmer nationality shall be determined\nby law."
                },
                {
                    "id": 34,
                    "tags": ["new", "one"],
                    "content": "Khmer citizens of both sexes shall enjoy the right to vote\nand to stand as candidates for the election.\nKhmer citizens of both sexes, at least eighteen years old,\nhave the right to vote.\nKhmer citizens of both sexes, at least twenty-five years\nold, have the right to stand as candidates for the elections of\nMembers of Parliament.\nKhmer citizens of both sexes, at least forty years old,\nhave the right to stand as candidates for the elections of the\nmembers of the Senate.\nProvisions depriving of the right to vote and the right to\nstand as candidates for the elections shall be determined by\nlaw."
                },
                {
                    "id": 35,
                    "tags": [],
                    "content": "Khmer citizens of both sexes have the right to participate\nactively in the political, economic, social and cultural life of\nthe nation.\nAll requests from citizens shall be given full consideration\nand resolution by the State’s organizations.\n"
                },
                {
                    "id": 36,
                    "tags": [],
                    "content": "Khmer citizens of both sexes have the right to choose any\nemployment according to their ability and to the needs of the\nsociety.\nKhmer citizens of both sexes shall receive equal pay for\nequal work.\nThe work of housewife at home shall have equal value as\nthe remunerated work done outside the home.\nKhmer citizens of both sexes shall have the right to enjoy\nsocial security and other social benefits as determined by law.\nKhmer citizens of both sexes shall have the right to create\ntrade unions and to participate as their members.\nThe organization and functioning of the trade unions\nshall be determined by law."
                },
                {
                    "id": 37,
                    "tags": [],
                    "content": "The rights to strike and to organize peaceful demonstrations\nshall be exercised within the framework of law."
                },
                {
                    "id": 38,
                    "tags": [],
                    "content": "The law guarantees against physical abuse of any person.\nThe law protects the life, the honor and the dignity of the\ncitizens.\nThe prosecution, arrest, police custody or detention of\nany person could be carried out only in accordance with the\nlaw.\nThe coercion, physical punishment or any other treatment\naggravating the penalty of the detainee or prisoner shall be\nforbidden. The author of such acts, co-authors and accomplices\nshall be punished according to the law.\nConfessions obtained by physical torture or mental\npressure shall not be admissible as evidence of guilt.\nThe doubt shall benefit the accused.\nAny accused is presumed innocent up to the final verdict\nof the court.\nAny individual shall have the right to his/her own defense\nthrough the judicial system."
                },
                {
                    "id": 39,
                    "tags": [],
                    "content": "Khmer citizens have the right to denounce, make\ncomplaints, or file claims for reparations of damages caused\nby any illegal actions by state and social organizations or by\nstaff of those organizations. The settlement of complaints and\nthe reparations of damages are of the competence of the courts."
                },
                {
                    "id": 40,
                    "tags": [],
                    "content": "Citizen’s freedom to travel, far or near, and to legally\nsettle down shall be respected.\nKhmer citizen has the right to settle abroad or to return\nhome.\nThe protection of the rights to the inviolability of residence\nand to the confidentiality of correspondences by mail, telegram,\ntelex, facsimile and telephone shall be guaranteed.\nSearch of residences, properties and body search shall be\ndone in accordance with the legal stipulations."
                },
                {
                    "id": 41,
                    "tags": [],
                    "content": "Khmer citizens shall have the freedom to express their\npersonal opinions, the freedom of the press, the freedom of\npublication and the freedom of assembly. No one can take\nabusively advantage of these rights to impinge on dignity\nof others, to affect the good mores and custom of society,\npublic order and national security.\nThe regime of the media shall be regulated by law."
                },
                {
                    "id": 42,
                    "tags": ["new"],
                    "content": "Khmer citizens shall have the right to create associations\nand political parties. This right shall be determined by law.\nPolitical party shall place the interest of the nation\nfirst and shall not conduct directly or indirectly any activity\naffecting the interest of the Kingdom of Cambodia and Khmer\ncitizens.\nKhmer citizens may participate in mass organizations\nfor mutual assistance, protection of national realizations and\nsocial order."
                },
                {
                    "id": 44,
                    "tags": [],
                    "content": "All persons, individually or collectively, shall have the\nright to ownership. Only natural person or legal entity of\nKhmer nationality shall have the right to land ownership.\nLegal private ownership shall be protected by law.\nExpropriation shall be possible only if public utility\ndemands in the cases stipulated by the law and if prior\nappropriate and fair compensation is granted."
                },
                {
                    "id": 45,
                    "tags": [],
                    "content": "All forms of discrimination against women shall be\nabolished.\nThe exploitation of women’s labor shall be prohibited.\nMen and women have equal rights in all fields, especially\nwith respect to those of marriage and family.\nMarriage shall be done according to the conditions set\nby the law and based on the principles of mutual consent and\nmonogamy."
                },
                {
                    "id": 46,
                    "tags": [],
                    "content": "Human trafficking, exploitation of prostitution and\nobscenities which affect the dignity of women shall be\nprohibited.\nThe dismissal of woman worker for reason of pregnancy\nshall be prohibited. Woman shall have the right to take maternity\nleave with full pay and with guarantee of her seniority in\nemployment and of other social benefits.\nThe State and the society shall create conditions to allow\nwomen, especially the destitute ones living in rural areas, to\nbenefit from assistance for having a profession, for medical cares,\nfor their children education and for decent living conditions."
                },
                {
                    "id": 47,
                    "tags": [],
                    "content": "Mother and father shall have the obligation to take care\nof their children, to bring them up and to educate them in order\nto become good citizens.\nChildren shall have the duty to attend to the needs of their\naged parents and to take good care of them in accordance with\nKhmer custom."
                },
                {
                    "id": 48,
                    "tags": [],
                    "content": "The State shall assure the protection of children’s rights as\nenshrined in the Convention on Children, especially, the right\nto life, the right to education, the right to protection during\nwartime and the right to protection from economic or sexual\nexploitation.\nThe State shall protect children from all kinds of labour\nthat can be detrimental to their education and their schooling,\nor to their health or their welfare."
                },
                {
                    "id": 49,
                    "tags": ["new"],
                    "content": "Every Khmer citizen shall respect the Constitution and\nthe laws.\nKhmer citizens shall place the interest of the nation\nfirst and shall not conduct directly or indirectly any activity\naffecting the interest of the Kingdom of Cambodia and Khmer\ncitizens.\nEvery Khmer citizen has the obligation to participate in\nthe national construction and to defend the motherland.\nThe obligation to defend the motherland shall be done in\naccordance with the provisions of the law."
                },
                {
                    "id": 50,
                    "tags": [],
                    "content": "Khmer citizens of both sexes shall respect the principles\nof national sovereignty and liberal multi-party democracy.\nKhmer citizens of both sexes shall respect public property\nand legitimate private property."
                }
            ]
        },
        {
            "id": 4,
            "title": "ON THE POLITICAL REGIME",
            "articles": [
                {
                    "id": 51,
                    "tags": ["new"],
                    "content": "The Kingdom of Cambodia implements a policy of liberal\nmulti-party democracy.\nKhmer citizens are masters of their country’s destiny.\nAll powers shall belong to the citizens. The citizens shall\nexercise their powers through the National Assembly, the\nSenate, the Royal Government and the Jurisdictions.\nThe powers shall be separated between the legislative\npower, the executive power and the judicial power."
                },
                {
                    "id": 52,
                    "tags": [],
                    "content": "The Royal Government of Cambodia shall commit\nitself resolutely to preserve and defend the independence,\nsovereignty, and territorial integrity of the Kingdom of\nCambodia, implement a policy of national reconciliation to\nensure national unity, and protect the good mores and custom\nof the nation. The Royal Government of Cambodia shall\ndefend the legality and ensure public order and security. The\nState shall give priority to the living conditions and welfare of\ncitizens."
                },
                {
                    "id": 53,
                    "tags": ["new"],
                    "content": "The Kingdom of Cambodia maintains resolutely a policy\nof permanent neutrality and non-alignment. The Kingdom of\nCambodia coexists peacefully with its neighbors and with all\nother countries throughout the world.\nThe Kingdom of Cambodia shall never invade any\ncountry, nor interfere in any other country’s internal affairs,\ndirectly or indirectly, and shall solve any problems peacefully\nwith due respect for mutual interests.\nThe Kingdom of Cambodia shall absolutely oppose any\nforeign interference in any form in its internal affairs.\nThe Kingdom of Cambodia shall not join in any military\nalliance, nor conclude any military agreement which is\nincompatible with its policy of neutrality.\nThe Kingdom of Cambodia shall not authorize any\nforeign military base on its territory, nor have its own military\nbases abroad, except within the framework of a United Nations\nrequest.\nThe Kingdom of Cambodia reserves the right to\nreceive foreign assistance in military equipment, armaments,\nammunition, in training of its armed forces, and other assistance\nfor self-defense and for ensuring public order and security\nwithin its territory."
                },
                {
                    "id": 54,
                    "tags": [],
                    "content": "The manufacture, use and storage of nuclear, chemical or\nbiological weapons shall be absolutely prohibited."
                },
                {
                    "id": 55,
                    "tags": [],
                    "content": "Any treaty and agreement incompatible with the\nindependence, sovereignty, territorial integrity, neutrality and\nnational unity of the Kingdom of Cambodia shall be abrogated."
                }
            ]
        }, {
            "id": 5,
            "title": "ON THE ECONOMY",
            "articles": [
                {
                    "id": 56,
                    "tags": [],
                    "content": "The Kingdom of Cambodia implements the market\neconomy system.\nThe organization and the functioning of this economic\nsystem shall be determined by the law."
                },
                {
                    "id": 57,
                    "tags": [],
                    "content": "Tax can be collected only when it is authorized by a\nlaw. The national budget shall be laid down and carried out in\naccordance with the law.\nThe monetary management and the financial system shall\nbe determined by the law."
                },
                {
                    "id": 58,
                    "tags": [],
                    "content": "State property notably consists of land, underground,\nmountains, sea, sea-bed, undersea-bed, coastline, airspace,\nislands, rivers, canals, streams, lakes, forests, natural resources,\neconomic and cultural centers, national defense bases, other\nbuilding facilities belonging to the State.\nThe administration, the utilization and the assignment of\nState’s properties shall be determined by the law."
                },
                {
                    "id": 59,
                    "tags": [],
                    "content": "The State shall preserve and protect the environment\nand the balance of natural resources, by organizing a precise\nplanning for the management, especially of the land, water,\natmosphere, air, geology, ecological systems, mines, energy,\npetroleum and gas, rocks, sand, gems, forests and forest by-\nproducts, wildlife, fish and aquatic resources."
                },
                {
                    "id": 60,
                    "tags": [],
                    "content": "Citizens have the right to freely sell and exchange their\nown products. The obligation to sell products to the State\nor the appropriation, even temporarily, of private riches or\npossessions by the State shall be prohibited, except under\nconditions specially authorized by the law."
                },
                {
                    "id": 61,
                    "tags": [],
                    "content": "The State shall promote economic development in\nall fields, especially in agriculture, handicraft, industry,\nto begin with the remotest areas, with concern for water\npolicy, electricity, roads and means of transportation, modern\ntechniques and credit system."
                },
                {
                    "id": 62,
                    "tags": [],
                    "content": "The State shall be concerned with resolving the means of\nproduction, sustaining the prices of agricultural and handicraft\nproducts, and helping find markets for these products to be\nsold."
                },
                {
                    "id": 63,
                    "tags": [],
                    "content": "The State shall attend to regulating the markets in order\nto secure a suitable living standard for the citizens."
                },
                {
                    "id": 64,
                    "tags": [],
                    "content": "The State shall forbid individuals to import, manufacture\nor sell illicit drugs, counterfeit products, expired goods harmful\nto the consumers’ health and life, and shall severely punish\nthem."
                }
            ]
        }
    ]
}